Ran Plan for dir: `terraform/github` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.fred_tests.github_repository.repo will be destroyed
  # (because github_repository.repo is not in configuration)
- resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = false -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"16aa27154d48af31737a9287cbb62dbf85ce22ea47751810e0e17880d33ca5b5\"" -> null
      - full_name                   = "fharper/fred_tests" -> null
      - git_clone_url               = "git://github.com/fharper/fred_tests.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/fharper/fred_tests" -> null
      - http_clone_url              = "https://github.com/fharper/fred_tests.git" -> null
      - id                          = "fred_tests" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "fred_tests" -> null
      - node_id                     = "R_kgDOJvgqFQ" -> null
      - private                     = true -> null
      - repo_id                     = 653797909 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:fharper/fred_tests.git" -> null
      - svn_url                     = "https://github.com/fharper/fred_tests" -> null
      - visibility                  = "private" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.gitops.github_repository.repo will be updated in-place
~ resource "github_repository" "repo" {
        id                          = "gitops"
        name                        = "gitops"
      ~ visibility                  = "public" -> "private"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.test2.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = false
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test2"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "private"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.kubefirst.dev/lock?id=fharper%252Fgitops%252Fterraform%252Fgithub%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/github`
</details>
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`